In [1]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [2]:
n_rows = 365*24
n_cols = 2
cols = ['col1','col2']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df.index = pd.util.testing.makeDateIndex(n_rows,freq='H')
df

C:\Users\steve\anaconda3\lib\site-packages\pandas\util\__init__.py:8: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

                     col1  col2
2000-01-01 00:00:00    15     8
2000-01-01 01:00:00     4    17
2000-01-01 02:00:00    19     7
2000-01-01 03:00:00    18    18
2000-01-01 04:00:00    10    18
...                   ...   ...
2000-12-30 19:00:00    11    12
2000-12-30 20:00:00     5    18
2000-12-30 21:00:00    10    18
2000-12-30 22:00:00     2     6
2000-12-30 23:00:00    17     1

[8760 rows x 2 columns]

In [3]:
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7392
2000-02-29  7032
2000-03-31  7561
2000-04-30  7224
2000-05-31  7215
2000-06-30  6992
2000-07-31  7508
2000-08-31  7642
2000-09-30  7067
2000-10-31  7560
2000-11-30  7270
2000-12-31  7367

In [4]:
df.resample('M')['col1'].sum().to_frame()

            col1
2000-01-31  7392
2000-02-29  7032
2000-03-31  7561
2000-04-30  7224
2000-05-31  7215
2000-06-30  6992
2000-07-31  7508
2000-08-31  7642
2000-09-30  7067
2000-10-31  7560
2000-11-30  7270
2000-12-31  7367

In [5]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [6]:
pd.DataFrame({'col1':[1,2,3,4],
             'col2':[5,6,7,8]})

   col1  col2
0     1     5
1     2     6
2     3     7
3     4     8

In [7]:
n_rows = 5
n_cols = 3

arr = np.random.randint(1,20,size=(n_rows,n_cols))
arr

array([[ 6, 13, 11],
       [ 4, 13, 13],
       [ 5, 17,  5],
       [12,  4,  3],
       [13, 18, 12]])

In [8]:
pd.DataFrame(arr,columns=tuple('ABC'))

    A   B   C
0   6  13  11
1   4  13  13
2   5  17   5
3  12   4   3
4  13  18  12

In [9]:
pd.util.testing.makeDataFrame().head()

                   A         B         C         D
ecTVWAf5Zi -0.484195  0.302905  0.565871  0.139655
U6qUXRJ600 -0.419397 -0.789534 -0.018217  0.023202
9pf5c831i6  1.006908 -0.531529 -0.333527 -0.288357
Km3hycnD9L -0.151563  0.428648 -0.463232  1.691710
j3d1C4MxjG  0.117453 -1.039576 -1.355078 -1.767453

In [10]:
pd.util.testing.makeMixedDataFrame().head()

     A    B     C          D
0  0.0  0.0  foo1 2009-01-01
1  1.0  1.0  foo2 2009-01-02
2  2.0  0.0  foo3 2009-01-05
3  3.0  1.0  foo4 2009-01-06
4  4.0  0.0  foo5 2009-01-07

In [11]:
pd.util.testing.makeTimeDataFrame().head()

                   A         B         C         D
2000-01-03  0.521863  0.914418 -1.007596 -0.315450
2000-01-04 -1.661610  0.750661 -0.902012  1.495341
2000-01-05  0.192788  0.747648  2.032994  1.364366
2000-01-06 -1.689436 -1.066527  0.061794  1.195049
2000-01-07 -1.128836  0.532005 -0.849000 -0.761335

In [12]:
pd.util.testing.makeMissingDataframe().head()

                   A         B         C         D
ECiZbTPEcw  0.908830  0.547920       NaN  0.051738
Da08bimTbU  1.263990  0.109777 -0.593599 -0.296675
JPgELXqSeZ -0.358864 -0.087961       NaN  0.218435
pmo65zRvpv -0.519060 -0.529374  0.137196 -0.112939
oMVFmrn0Fz -0.431956 -0.673437  0.450312 -0.332005

In [13]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.2.4
1.20.1

In [14]:
n_rows =5
n_cols = 2
cols = ['omset','operasional']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df

   omset  operasional
0      2           12
1     17           15
2      1           14
3     15            2
4      9           17

In [15]:
df['omset']=df['omset']*100_000
df['operasional']=df['operasional']*10_000
df

     omset  operasional
0   200000       120000
1  1700000       150000
2   100000       140000
3  1500000        20000
4   900000       170000

In [16]:
df.index = pd.util.testing.makeDateIndex(n_rows,freq='D')
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

     tanggal    omset  operasional
0 2000-01-01   200000       120000
1 2000-01-02  1700000       150000
2 2000-01-03   100000       140000
3 2000-01-04  1500000        20000
4 2000-01-05   900000       170000

In [17]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset':'Rp {:.2f}'}
laporan = df.style.format(formatku)
laporan

In [18]:
type(laporan)

pandas.io.formats.style.Styler

In [19]:
laporan.hide_index()

In [20]:
laporan.set_caption('Data Omset dan Operasional')

In [21]:
laporan.highlight_min('omset',color='pink')
laporan.highlight_max('omset',color='lightgreen')

laporan.highlight_min('operasional',color='lightblue')
laporan.highlight_min('operasional',color='grey')

In [22]:
import pandas as pd
print(pd.__version__)

1.2.4

In [23]:
d1 = {'col1':[1,2,3],
     'col2':[10,20,30]}
df1 = pd.DataFrame(d1)
df1

   col1  col2
0     1    10
1     2    20
2     3    30

In [24]:
d2 = {'col1':[4,5,6],
     'col2':[40,50,60]}
df2 = pd.DataFrame(d2)
df2

   col1  col2
0     4    40
1     5    50
2     6    60

In [25]:
df = pd.merge(df1,df2,left_index=True,right_index=True)
df

   col1_x  col2_x  col1_y  col2_y
0       1      10       4      40
1       2      20       5      50
2       3      30       6      60